export function nojaize(text: string): string {
	return text
		// ja-JP
		.replace(/だ$/gm, 'じゃ')
		.replace(/(だ{1})(?=。|\.|、|\,|\！|\!|\?|\？|\…|\・|\‥|\ー)/gm, 'じゃ')
		.replace(/のだ$/gm, 'のじゃ')
		.replace(/(のだ{1})(?=。|\.|、|\,|\！|\!|\?|\？|\…|\・|\‥|\ー)/gm, 'のじゃ')
		.replace(/かな$/gm, 'かの')
		.replace(/(かな{1})(?=。|\.|、|\,|\！|\!|\?|\？|\…|\・|\‥|\ー)/gm, 'かの')
		.replace(/だな$/gm, 'じゃの')
		.replace(/(だな{1})(?=。|\.|、|\,|\！|\!|\?|\？|\…|\・|\‥|\ー)/gm, 'じゃの')
		.replace(/なの$/gm, 'なのじゃ')
		.replace(/(なの{1})(?=。|\.|、|\,|\！|\!|\?|\？|\…|\・|\‥|\ー)/gm, 'なのじゃ');
}
